#!/usr/bin/env bash
set -euo pipefail
IFS=$'\n\t'
# 半角 --> 全角
# 页码：-1-, 1, I-1, 第1页
# 制表符 --> 空格
# 删掉行尾空格
# 压缩连续空格
# 标点左侧和右侧的空格
# 项目符号
# 修正部分句内换行

fn_in="$1"
fn_out="${1/.txt}".tmp
cat "$fn_in" |\
    sed -E 's/^\s*[_—一-]+\s*[0-9]+\s*[_—一-]+//g' |\
    sed -E 's/^\s*[0-9]+\s*\/\s*[0-9]+\s*//g' |\
    sed -E 's/^\s*[0-9]{1,3}\s*$//g' |\
    sed -E 's/^第\s*[0-9]+\s*页//g' |\
    sed -E 's/^\s*[ivxIVX]+\s*-[0-9]+\s*$//g' |\
    sed -E 's/\t/ /g' |\
    sed -E 's/　/ /g' |\
    sed -E 's/,/，/g' |\
    sed -E 's/([0-9]+)\s*，\s*([0-9]+)/\1,\2/g' |\
    sed -E 's/;/；/g' |\
    sed -E 's/:/：/g' |\
    sed -E 's/\)/）/g' |\
    sed -E 's/\(/（/g' |\
    sed -E 's/!/！/g' |\
    sed -E 's/ +$//g' |\
    sed -E 's/^ +//g' |\
    sed -E 's/[(（] *([0-9a-z]+) *[)）]\s*/(\1) /g' |\
    sed -E 's/([。，：；（）【】！？“”%、]) +/\1/g' |\
    sed -E 's/ +([。，：；（）【】！？“”%、])/\1/g' |\
    sed -E 's/^[□§O・■♦►•—-]\s*//g' |\
    tr --squeeze-repeats '\n' |\
    tr --squeeze-repeats ' ' |\
    sed -E '1~2b;{N;s/([第的，、])\n/\1/g}' |\
    sed -E '2~2b;{N;s/([第的，、])\n/\1/g}' > "$fn_out"

mv --force "$fn_out" "$fn_in"
#perl -CIOED -p -e \
#    's/^((?:[a-z]|[0-9]){1,3})\.?(\p{Block=CJK_Unified_Ideographs})/\1. \2/g;s/([0-9]+)(?: +\. +| +\.|\. +)(\p{Block=CJK_Unified_Ideographs})/\n\1. \2/g' |\
#sed -E 's/^\s*(中国民用航空局.*司)$/\n\1\n/g' |\
#sed -E 's/^\s*(中华人民共和国行业标准)$/\n\1\n/g' |\
#sed -E 's/^\s*(信息通告)$/\n\1\n/g' |\
#sed -E 's/^\s*(公告)$/\n\1\n/g' |\
#sed -E 's/^\s*([^关]*关于.*的通知)$/\n\1\n/g' |\
#sed -E 's/^\s*([^关]*关于.*的公告)$/\n\1\n/g' |\
#sed -E 's/^\s*(编号[：:]?.*)$/\n\1\n/g' |\
#sed -E 's/^\s*(抄送[：:]?.*)$/\n\1\n/g' |\
#sed -E 's/^\s*(编制部门[：:]?.*)$/\n\1\n/g' |\
#sed -E 's/^\s*(前言)\s*$/\n\1\n/g' |\
#sed -E 's/^\s*(引言)\s*$/\n\1\n/g' |\
#sed -E 's/^\s*(附录.*)$/\n\1\n/g' |\
#sed -E 's/^\s*(目[录次].*)$/\n\1\n/g' |\
#sed -E 's/^\s*(总则)$/\n\1\n/g' |\
#sed -E 's/^\s*(定义)$/\n\1\n/g' |\
#sed -E 's/^\s*(下发日期[：:]?.*)$/\n\1\n/g' |\
#sed -E 's/^\s*(日期[：:]?.*)$/\n\1\n/g' |\
#sed -E 's/^\s*([授批]准[：:]?.*)$/\n\1\n/g' |\
#sed -E 's/^\s*(批准人[：:]?.*)$/\n\1\n/g' |\
#sed -E 's/^\s*(承办单位[：:]?.*)$/\n\1\n/g' |\
#sed -E 's/^\s*(主编单位[：:]?.*)$/\n\1\n/g' |\
#sed -E 's/^\s*(参编单位[：:]?.*)$/\n\1\n/g' |\
#sed -E 's/^\s*(批准部门[：:]?.*)$/\n\1\n/g' |\
#sed -E 's/^\s*(施行日期[：:]?.*)$/\n\1\n/g' |\
#sed -E 's/^\s*(安全措施)$/\n\1\n/g' 
#sed -E 's/^(第[一二三四五六七八九十]+[条章节篇])\s*(.*)/\n\1\n\n\2/g' |\
#sed -E 's/^(第[一二三四五六七八九十]+部分)\s*(.*)/\n\1\n\n\2/g' |\
#sed -E 's/^第\s*([0-9ivxIVX.]+)\s*([条章节篇])\s*(.*)/\n第 \1 \2\n\n\3/g' |\
#sed -E 's/^第\s*([0-9ivxIVX.]+)\s*部分\s*(.*)/\n第 \1 部分\n\n\2/g' |\
#sed -E 's/([(（][一二三四五六七八九十]+[)）].*)/\n\1\n/g' |\
#sed -E 's/^([一二三四五六七八九十]+、.*)/\n\1\n/g' |\
#sed -E 's/^(\(?[0-9a-z.]+\)?.*)/\n\1\n/g' |\
#sed -E 's/([0-9])( +\. +| +\.|\. +)([0-9])/\1.\3/g;' |\
#sed -E 's/^\([a-z]+\)( +\. +| +\.|\. +)/\1 /g' |\
#sed -E 's/^([0-9]+)(\.[0-9]+)+([^0-9 ])/\1\2 \3/g' |\
# sed -E 's/刖言/前言/g' |\
